Revit 2027 API
LinkLoadResult.GetModelName Method
 Gets the name of the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetModelName()
Public Function GetModelName As ModelPath
public:
ModelPath^ GetModelName()
member GetModelName : unit -> ModelPath
Return Value
ModelPath
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace